spec/fixtures/vcr_casettes/create_checkout/valid.yml

---
http_interactions:
- request:
    method: post
    uri: https://global-api-sandbox.afterpay.com/v2/checkouts
    body:
      encoding: UTF-8
      string: '{"amount":{"amount":"110.0","currency":"USD"},"consumer":{"phoneNumber":null,"givenNames":"John","surname":"Von
        Doe","email":"email3@example.com"},"billing":{"name":"John Von Doe","line1":"PO
        Box 1337","line2":"Northwest","area1":"Herndon","area2":null,"region":"AL","postcode":"10005","countryCode":null,"phoneNumber":"555-555-0199"},"shipping":{"name":"John
        Von Doe","line1":"A Different Road","line2":"Northwest","area1":"Herndon","area2":null,"region":"AL","postcode":"10006","countryCode":null,"phoneNumber":"555-555-0199"},"courier":null,"items":[{"name":"Product
        #3 - 9548","sku":"SKU-3","pageUrl":null,"imageUrl":null,"quantity":1,"price":{"amount":"10.0","currency":"USD"},"categories":null,"estimatedShipmentDate":null}],"discounts":null,"merchant":{"redirectConfirmUrl":"https://merchantsite.com/confirm","redirectCancelUrl":"https://merchantsite.com/cancel"},"paymentType":null,"merchantReference":"R444808561","taxAmount":null,"shippingAmount":null}'
    headers:
      User-Agent:
      - SolidusAfterpay/0.0.1 (Solidus/3.0.1; Ruby/2.6.6; Merchant/100101481) https://
      Authorization:
      - Basic <ENCODED_AUTH_HEADER>
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Wed, 25 Aug 2021 14:56:00 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '249'
      Connection:
      - keep-alive
      Http-Correlation-Id:
      - rdpkhcwkeqlv2irhiask3pltjm
      X-Envoy-Upstream-Service-Time:
      - '37'
      Cf-Cache-Status:
      - DYNAMIC
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Set-Cookie:
      - __cf_bm=f6c4d0cdcaa29e5fddf69187d3f8669a0ff92516-1629903360-1800-AROMdFTai3kYVqaapy1FVuhHoAKL/UoScijdZgg9OdkkdqwLfjx1l7Cxk6Yqm0qHyKkjCQ7NGmcCyeB39rNMBT1lETNAwhlDqfY+CJ6kAb6/;
        path=/; expires=Wed, 25-Aug-21 15:26:00 GMT; domain=.afterpay.com; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 6845aa243bb0fc89-FCO
    body:
      encoding: UTF-8
      string: |-
        {
          "token" : "002.nq5oa41fisldkbfvtfjqc9nl1c6jhjna0b92osmstabi2lse",
          "expires" : "2021-08-25T17:56:00.817Z",
          "redirectCheckoutUrl" : "https://portal.sandbox.afterpay.com/us/checkout/?token=002.nq5oa41fisldkbfvtfjqc9nl1c6jhjna0b92osmstabi2lse"
        }
  recorded_at: Wed, 25 Aug 2021 14:56:00 GMT
recorded_with: VCR 6.0.0
