spec/fixtures/vcr_casettes/credit/valid.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.us-sandbox.afterpay.com/v2/payments/100101768366/refund
    body:
      encoding: UTF-8
      string: '{"requestId":null,"merchantReference":null,"refundMerchantReference":null,"amount":{"amount":"10.0","currency":"USD"}}'
    headers:
      User-Agent:
      - SolidusAfterpay/0.0.1 (Solidus/3.0.1; Ruby/2.6.6; Merchant/100101481) https://
      Authorization:
      - Basic <ENCODED_AUTH_HEADER>
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Wed, 25 Aug 2021 14:56:33 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '140'
      Connection:
      - keep-alive
      Http-Correlation-Id:
      - 24wpvce67xhgrrg5pqe3fgduda
      X-Envoy-Upstream-Service-Time:
      - '54'
      Cf-Cache-Status:
      - DYNAMIC
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Set-Cookie:
      - __cf_bm=e9f4b17314baa927279640073ce9b4ff5a20400f-1629903393-1800-ATEYxDJqfplwOhv7PEuvKTFvzf0cFIA+ctvgNlZuMf4O535a4edKPQ9QImknp0pT7qSY2FRZdUqe/b84LTROEUWm/jP2XhxTGtcGJcCBLyDH;
        path=/; expires=Wed, 25-Aug-21 15:26:33 GMT; domain=.afterpay.com; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 6845aaf1fb7fcd42-FCO
    body:
      encoding: UTF-8
      string: |-
        {
          "amount" : {
            "amount" : "10.00",
            "currency" : "USD"
          },
          "refundId" : "1934419",
          "refundedAt" : "2021-08-25T14:56:33.753Z"
        }
  recorded_at: Wed, 25 Aug 2021 14:56:33 GMT
recorded_with: VCR 6.0.0
