spec/fixtures/vcr_casettes/deferred/authorize/invalid.yml

---
http_interactions:
- request:
    method: post
    uri: https://global-api-sandbox.afterpay.com/v2/payments/auth
    body:
      encoding: UTF-8
      string: '{"token":"INVALID_TOKEN","merchantReference":null,"amount":{"amount":"10.0","currency":"USD"}}'
    headers:
      Content-Type:
      - application/json
      User-Agent:
      - SolidusAfterpay/0.1.0 (Solidus/3.2.0.alpha; Ruby/2.5.7; Merchant/100101481)
        https://
      Authorization:
      - Basic MTAwMTAxNDgxOmVhMzQ0MzVhMjg2ZDM2ZDYwYWIwYzljMTdmMWNhZjlhZGVjOGM2MTRiMDRhYzUyMTgzYzFkNzlhYTUwOTRhMDg2ZWZkYzJhODM2ZTk5NDUwODY1OTE3MDUzODJlZjEzMmFmODNiZjdhNTMwNjQ0ZGQ3MjUwNmU4YjU2NTA2MWU0
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Date:
      - Tue, 05 Oct 2021 05:39:05 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '163'
      Connection:
      - keep-alive
      Cf-Ray:
      - 69944eb23f623839-MAD
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Cf-Cache-Status:
      - DYNAMIC
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Http-Correlation-Id:
      - anqbly2zsfu6i64f2odlfxmjpi
      X-Envoy-Upstream-Service-Time:
      - '630'
      Set-Cookie:
      - __cf_bm=FpwD7EcSFB_1kG_67Jove0oQ4S5QOe1Rh19KZTcXFc8-1633412345-0-AZC0Aplw/d39Qa3DXdZUUiZI+mN521a+818jFBUsj3NnLjIJ7WZaIiyOe7oZE6cxXNXhF7xFd5d2BBgYDcf76L8MYv7re2WaWvHuQM7Lz+6V;
        path=/; expires=Tue, 05-Oct-21 06:09:05 GMT; domain=.afterpay.com; HttpOnly;
        Secure; SameSite=None
      Vary:
      - Accept-Encoding
      Server:
      - cloudflare
    body:
      encoding: UTF-8
      string: |-
        {
          "errorCode" : "invalid_token",
          "errorId" : "ea2066cbf7fe48d6",
          "message" : "Cannot complete payment, expired or invalid token.",
          "httpStatusCode" : 402
        }
  recorded_at: Tue, 05 Oct 2021 05:39:05 GMT
recorded_with: VCR 6.0.0
