spec/fixtures/vcr_casettes/deferred/void/valid.yml

---
http_interactions:
- request:
    method: post
    uri: https://global-api-sandbox.afterpay.com/v2/payments/100101785223/void
    body:
      encoding: UTF-8
      string: '{"token":null,"merchantReference":null,"amount":{"amount":"10.0","currency":"USD"}}'
    headers:
      User-Agent:
      - SolidusAfterpay/0.0.1 (Solidus/3.0.1; Ruby/2.6.6; Merchant/100101481) https://
      Authorization:
      - Basic <ENCODED_AUTH_HEADER>
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 31 Aug 2021 10:22:03 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1993'
      Connection:
      - keep-alive
      Http-Correlation-Id:
      - 3djladyckq4eyixzpg25kpstqu
      X-Envoy-Upstream-Service-Time:
      - '59'
      Cf-Cache-Status:
      - DYNAMIC
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Set-Cookie:
      - __cf_bm=fccd84a710b94b8835e58821b8d3c0ad1a209709-1630405323-1800-AYRVwW5QoB3nL1+7aXeNkU5GPWIIR9p7HJ8Xb+bPGzsIxsn4/9+CICpHFq0kc8GfVcOqp4DVI8LmsaGeOmIX8vwPlIuoLaZxsJHCFx18Vmje;
        path=/; expires=Tue, 31-Aug-21 10:52:03 GMT; domain=.afterpay.com; HttpOnly;
        Secure; SameSite=None
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Server:
      - cloudflare
      Cf-Ray:
      - 68758912f9d66f64-FCO
    body:
      encoding: UTF-8
      string: |-
        {
          "id" : "100101785223",
          "token" : "002.e247pp0rcn2fp1qvkfga4dtnnjk1858p389alt6738j5flm9",
          "status" : "APPROVED",
          "created" : "2021-08-31T10:21:04.482Z",
          "originalAmount" : {
            "amount" : "26.24",
            "currency" : "USD"
          },
          "openToCaptureAmount" : {
            "amount" : "16.24",
            "currency" : "USD"
          },
          "paymentState" : "AUTH_APPROVED",
          "merchantReference" : "R435232519",
          "refunds" : [ {
            "amount" : {
              "amount" : "10.00",
              "currency" : "USD"
            },
            "refundId" : "1948421",
            "refundedAt" : "2021-08-31T10:22:02.911Z"
          } ],
          "orderDetails" : {
            "consumer" : {
              "phoneNumber" : "",
              "givenNames" : "Christian",
              "surname" : "Rimondi",
              "email" : "admin@example.com"
            },
            "billing" : {
              "name" : "Christian Rimondi",
              "line1" : "1313 Broadway",
              "line2" : "",
              "area1" : "New York",
              "region" : "NY",
              "postcode" : "10001",
              "phoneNumber" : "12524264421"
            },
            "shipping" : {
              "name" : "Christian Rimondi",
              "line1" : "1313 Broadway",
              "line2" : "",
              "area1" : "New York",
              "region" : "NY",
              "postcode" : "10001",
              "phoneNumber" : "12524264421"
            },
            "courier" : { },
            "items" : [ {
              "name" : "Solidus T-Shirt",
              "sku" : "SOL-00003",
              "quantity" : 1,
              "price" : {
                "amount" : "19.99",
                "currency" : "USD"
              }
            } ],
            "discounts" : [ ]
          },
          "events" : [ {
            "id" : "1xUMc5a8zg55pFQOS3AIRh8Aozs",
            "created" : "2021-08-31T10:21:29.045Z",
            "expires" : "2021-09-07T10:21:29.044Z",
            "type" : "AUTH_APPROVED",
            "amount" : {
              "amount" : "26.24",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : null
          }, {
            "id" : "1xUMgHuj1jjX1bYsQRYhUjVK9Gz",
            "created" : "2021-08-31T10:22:02.927Z",
            "expires" : null,
            "type" : "VOIDED",
            "amount" : {
              "amount" : "10.00",
              "currency" : "USD"
            },
            "paymentEventMerchantReference" : null
          } ]
        }
  recorded_at: Tue, 31 Aug 2021 10:22:03 GMT
recorded_with: VCR 6.0.0
